# <center><u>Pandas <u> </center>

## 1.[Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

Import pandas and numpy with their aliases

In [2]:
import numpy as np
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [3]:
a = pd.Series([ 100, 200, 300, 400])

Print a, and data type

In [4]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [5]:
print(a[2])

300

What are the values of index for series a?

In [7]:
a.index

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [10]:
a = pd.Series([ 100, 200, 300, 400], index = ['c','a','b','d'])
a

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [11]:
a['d']

400

Sort the values wrt to the index and print it

In [14]:
a = a.sort_index()
a

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [13]:
b= pd.Series([800,450,100] , index = ['e','f','g'])
b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [17]:
a = a.append(b)

In [18]:
#print a again after appending b into it
a

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [27]:
#a = a.sort_values(ascending=False, kind='heapsort')
a = a.sort_values(ascending=False, kind='stable')

In [28]:
# print index of a

a.index

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

## 2. Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [29]:
df = pd.DataFrame(a)
print(df)

     0
e  800
f  450
d  400
b  300
a  200
g  100
c  100

Point to ponder! Don't you think series a and dataframe df looks alike? But there must be some difference between them. 
Hey buddy think and write your thoughts below.

In [ ]:
# happy to know your comment
In series datatype is mentioned 
In Dataframe column number is mentioned on top which indicates that dataframe can contain more than one series

What is the **shape of the datafarme** <br>

In [23]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the **index of the dataframe**, is it same as the series 'a' ?

In [30]:
df.index

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

print the **head and tail** of the dataframe. <br>
Additional - (what does head and tali represent?)

In [31]:
#head
df.head() # top 5 values

     0
e  800
f  450
d  400
b  300
a  200

In [32]:
#tail
df.tail() # 5 values from bottom

     0
d  400
b  300
a  200
g  100
c  100

**Rename the columns of the dataframe** as 'points'

In [34]:
df.rename(columns= {0 : 'points'}, inplace = True)
df

   points
e     800
f     450
d     400
b     300
a     200
g     100
c     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [35]:
#Create fruits array
import random
fruits = np.random.choice(['orange','mango','apple'], 7)
fruits

array(['apple', 'apple', 'orange', 'mango', 'apple', 'apple', 'orange'],
      dtype='<U6')

The above output might vary based randomness

In [36]:
#Create series fruits out of fruits array
pd.Series(fruits)

0     apple
1     apple
2    orange
3     mango
4     apple
5     apple
6    orange
dtype: object

**Change the index** of fruits to the index of dataframe df

In [37]:
pd.Series(fruits, index = df.index)

e     apple
f     apple
d    orange
b     mango
a     apple
g     apple
c    orange
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits' <br> print the head of the dataframe to verify

In [41]:
df['fruits'] = fruits
df.head()

   points  fruits
e     800   apple
f     450   apple
d     400  orange
b     300   mango
a     200   apple

<u>Bonus optional question:</u> <br>
What if we had to changed the index of the dataframe? <br>
Try to add any series to the dataframe with the origianl index (when index of series is not same as to the index of dataframe)

Use series as pd.Series([100,200,300,400,500,600,700]) and try to add it to df with column name Bonus_number.

In [42]:
#bonus code here
Bonus_number = pd.Series([100,200,300,400,500,600,700], index = df.index)
df['Bonus_number'] = Bonus_number
df.head()

   points  fruits  Bonus_number
e     800   apple           100
f     450   apple           200
d     400  orange           300
b     300   mango           400
a     200   apple           500

### Part 2

Create a dataframe  d1 where the columns are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [3]:
d1 = pd.DataFrame()
d1['city'] = pd.Series(['Chandigarh','Delhi','Kanpur','Chennai','Manali'])
d1['Temperature'] = pd.Series([15,22,20,26,-2])

Print d1

In [44]:
print(d1)

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [45]:
d1.shape

(5, 2)

Set city = d1['city']

In [46]:
city = d1['city']

print city <br>
What is the type of city.

In [47]:
print(city)
print(type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object
<class 'pandas.core.series.Series'>

Create another dataframe d2 where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [4]:
d2 = pd.DataFrame({
    'city' : ['Bengalaru','Coimbatore','Srirangam','Pondicherry'],
    'Temperature' : [24,35,36,39]
})
print(d2)

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [54]:
d2.shape

(4, 2)

**merge the two dataframes** together, save it in a new dataframe named 'd3'

In [5]:
d3 = pd.DataFrame(d1.append(d2))
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

# fun fact at high level

1. **.concat()** simply stacks multiple DataFrame together either vertically, or stitches horizontally after aligning on index
2. **.merge()** first aligns two DataFrame' selected common column(s) or index, and then pick up the remaining columns from the aligned rows of each DataFrame

Select the part of the dataframe such that it contains cities where temp is less then or equal to 20 <br>
How many cities are there?

In [56]:
d3[d3['Temperature'] <= 20]

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [57]:
d3[d3['Temperature'] >= 30]

          city  Temperature
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

## 3. Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [6]:
# write function here
d3['is_ut']=d3['city'].apply(lambda x: x in ['Chandigarh','Pondicherry','Delhi' ])

In [7]:
#print d3
d3

          city  Temperature  is_ut
0   Chandigarh           15   True
1        Delhi           22   True
2       Kanpur           20  False
3      Chennai           26  False
4       Manali           -2  False
0    Bengalaru           24  False
1   Coimbatore           35  False
2    Srirangam           36  False
3  Pondicherry           39   True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [8]:
# write function here
def c_to_f(temp):
     return (9/5 * temp) + 32

In [9]:
# check  function c_to_f(10)
print(c_to_f(10))

50.0

In [10]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'
d3['temp_farenhiet'] = c_to_f(d3['Temperature'])
d3

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
2       Kanpur           20  False            68.0
3      Chennai           26  False            78.8
4       Manali           -2  False            28.4
0    Bengalaru           24  False            75.2
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

## 4. Indexing and selecting rows in DataFrame

Select subset of the dataframe d3 such that it contains the cities which are union territories.

In [11]:
d3[d3['is_ut'] == True]

          city  Temperature  is_ut  temp_farenhiet
0   Chandigarh           15   True            59.0
1        Delhi           22   True            71.6
3  Pondicherry           39   True           102.2

Select a subset of the dataframe d3 such that it contains the cities which only have temperature above 90 Farenhiet.

In [12]:
d3[d3['temp_farenhiet'] >90]

          city  Temperature  is_ut  temp_farenhiet
1   Coimbatore           35  False            95.0
2    Srirangam           36  False            96.8
3  Pondicherry           39   True           102.2

Select only the first three rows of the dataframe d3.

In [13]:
d3[:3]

         city  Temperature  is_ut  temp_farenhiet
0  Chandigarh           15   True            59.0
1       Delhi           22   True            71.6
2      Kanpur           20  False            68.0

Select all the rows and last two columns in the dataframe.

In [14]:
d3[['is_ut','temp_farenhiet']]

   is_ut  temp_farenhiet
0   True            59.0
1   True            71.6
2  False            68.0
3  False            78.8
4  False            28.4
0  False            75.2
1  False            95.0
2  False            96.8
3   True           102.2

## 5. Reading csv file and group by

Read the file 'weather_data.csv' and store it in a pandas dataframe 'df'

In [16]:
df = pd.read_csv('weather_data.csv')

print the shape and head of the dataframe

In [18]:
print(df.shape)
df.head()

(6, 4)

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

Group the dataframe wrt to 'event' and save the resulting output in a variable named 'g'

In [19]:
g = df.groupby(df['event'])

Print g and  type(g)

In [20]:
print(g)
print(type(g))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000267B7D7A760>
<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

**Iterate** over all the temperatures in g and print them

In [21]:
list(g)

[('Rain',
          day  temperature  windspeed event
  0  1/1/2017           32          6  Rain
  4  1/5/2017           32          4  Rain),
 ('Snow',
          day  temperature  windspeed event
  2  1/3/2017           28          2  Snow
  3  1/4/2017           24          7  Snow),
 ('Sunny',
          day  temperature  windspeed  event
  1  1/2/2017           35          7  Sunny
  5  1/6/2017           31          2  Sunny)]

Use the **describe** method on g to get the complete description on it.

In [22]:
g.describe()

      temperature                                               windspeed  \
            count  mean       std   min   25%   50%   75%   max     count
event
Rain          2.0  32.0  0.000000  32.0  32.0  32.0  32.0  32.0       2.0
Snow          2.0  26.0  2.828427  24.0  25.0  26.0  27.0  28.0       2.0
Sunny         2.0  33.0  2.828427  31.0  32.0  33.0  34.0  35.0       2.0


      mean       std  min   25%  50%   75%  max
event
Rain   5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

Create a new column in the dataframe df, named 'hot_temp' which contains True if temp is above 30, else False

In [23]:
#code here to filter df with above condition
df['hot_temp'] = df['temperature']>30

In [24]:
# print df
df

        day  temperature  windspeed  event  hot_temp
0  1/1/2017           32          6   Rain      True
1  1/2/2017           35          7  Sunny      True
2  1/3/2017           28          2   Snow     False
3  1/4/2017           24          7   Snow     False
4  1/5/2017           32          4   Rain      True
5  1/6/2017           31          2  Sunny      True

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [25]:

a = pd.date_range(start = '2020-01-01', end = '2021-04-01')

print a

In [26]:
a

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [27]:
len(a)

457

What is the type of a?

In [28]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex

___________________________________________________________________________________________________________________________